/*
Добавить к программе Занятия 3: 
Создать иерархию графических классов. Описания классов оформить в отдельном модуле.

			ТОЧКА     ОТРЕЗОК    ОКРУЖНОСТЬ	
			
			ПРЯМОУГОЛЬНИК ТРЕУГОЛЬНИК ЭЛЛИПС
			
                                    РОМБ 
			
Добавить методы движения фигур:
	a) прямолинейное движение с отражением от стенок экрана
	b) вращение вокруг центра фигуры
При описании методов движения и рисования фигур использовать статические (не виртуальные) методы.
*/

#include <stdio.h>


int main()
{
	
	return 0;
}
