;---------Prg01_01.asm----------------------------------------------------------------------------
; Пример выделения значений 
; Исходная строка: 0abcdh 
; Результат	 : 0bdh
;-----------------------------------------------------------------------------------------------------
masm
model small
.data
var1	dw	0abcdh 	
var2	db	

.code
start:
	mov	ax,@data
	mov	ds,ax
;----------------------------           ; bh  bl
; Вставка                               
	mov	bx,var1		 	; ab  cd
	shl	bh,4                    ; b0  cd
	and	bl,0fh                  ; b0  0d
	or	bh,bl                   ; bd  0d
	mov	var2,bh                 ; bd

;----------------------------
	mov	ax,4c00h
	int	21h
end	start

