/*
Задание 1 Написать процедуры и функции для работы со списком
	A. добавление элемента после к-ого элемента списка
	B. удаление из списка к-ого элемента
	C. подсчет числа элементов в списке
	D. перемещение р-ого элемента списка после к-ого элемента
	С. помощью этих процедур и функций создать список следующим образом. Включать в список полные квадраты из одномерного массива целых чисел (типа Byte). Удалить повторяющиеся элементы списка. Определить длину полученного списка.

Задание 2 Написать программу, которая визуально демонстрирует работу стека и очереди. Длина стека и очереди ограничена 10 элементами.
*/

#include <stdio.h>
//#include "stack.h"
//#include "list.h"
//#include "queue.h"

int main()
{
	
	return 0;
}
