/*
- В файле fibheap.c реализовать функции для работы с Фибоначчиевой кучей (fibonacci heap)
	- Добавление элемента в min-heap
	- Поиск минимального элемента
	- Слияние двух куч
	- Удаление узла с минимальным приоритетом
	- Уменьшение ключа
	- Удаление заданного узла
Контрольные вопросы:
1 Структура Фибоначчиевой кучи
2 Максимальная степень узла в Фибоначчиевой куче
3 Добавление узла
4 Слияние двух куч
5 Алгоритм удаления узла с минимальным приоритетом (уплотнение списка корней – consolidate)
6 Вычислительная сложность операций
*/

#include <stdio.h>

int main(int argc, char **argv)
{

	return 0;
}
