/*
	Решить, используя арифметические, логические операции и операции сравнения.
	Разработать программы, обеспечивающую проверку попадания заданной координаты в указанные интервалы:
		1.x∈[0; +∞)
		2.x∈[5; 15)
		3.x∈(-1; 1)
		4.x∈(-1; 1)∪ [5; 15)
		5.x∈(-1; 1)∪ [5; 15) ∪ {20, 100, 1000}
*/

#include <stdio.h>

int main()
{
	int a = 0;
	printf("Введите X: ");
	scanf("%d", &a);

	printf("\tx∈[0; +∞) при X=%d:\t\t\t\t%d\n", a, (a >= 0));
	printf("\tx∈[5; 15) при X=%d:\t\t\t\t%d\n", a, ((a >= 5) && (a <15)));
	printf("\tx∈(-1; 1) при X=%d:\t\t\t\t%d\n", a, ((a > -1) && (a < 1)));
	printf("\tx∈(-1; 1)∪[5; 15) при X=%d:\t\t\t%d\n", a, (((a > -1) && (a < 1)) || ((a >= 5) && (a < 15))));
	printf("\tx∈(-1; 1)∪[5; 15)∪{20, 100, 1000} при X=%d:\t%d\n", a, (((a > -1) && (a < 1))||((a == 20)||(a == 100) || (a == 1000)) || ((a >= 5) && (a < 15))));
	return 0;
}

