/*
Решить, используя арифметические, логические операции и операции сравнения.
Разработать программы, обеспечивающую проверку попадания координат точки двумерного пространства, заданной с клавиатуры, в указанные области:
	1. (x,y)∈(-1; 1) x (-1;1)
	2. (x,y)∈(-1; 1)∪[5; 15) x (-1;1)
	3. (x,y)∈(-1; 1)∪[5; 15) x (-1;1)∪[2;3]
*/

#include <stdio.h>

int main()
{
	int x = 0, y = 0;
	printf("Введите X и Y: ");
	scanf("%d %d", &x, &y);
	printf("\t(x,y)∈(-1; 1) x (-1;1) при X=%d; Y=%d:\t\t\t%d\n", x, y, (((x > -1) && (x < 1)) && ((y > -1) && (y < 1))));
	printf("\t(x,y)∈(-1; 1)∪[5; 15) x (-1;1) при X=%d; Y=%d:\t\t%d\n", x, y, (((x > -1) && (x < 1) || ((x >= 5) && (x < 15))) && ((y > -1) && (y < 1))));
	printf("\t(x,y)∈(-1; 1)∪[5; 15) x (-1;1)∪[2;3] при X=%d; Y=%d:\t%d\n", x, y, (((x > -1) && (x < 1) || ((x >= 5) && (x < 15))) && ((y > -1) && (y < 1) || ((y >= 2) && (y <= 3)))));
	return 0;
}

