/*
Задание 1. Создать динамический двумерный массив размером 200x200 элементов, заполнить его случайными целыми числами (типа Byte). Переписать элементы матрицы во вновь созданный одномерный динамический массив в следующем порядке
	a) по правым диагоналям, начиная с правого верхнего элемента
	b) по левым диагоналям, начиная с левого верхнего элемента
	c) по спирали, начиная с центрального элемента
	d) по спирали, начиная с левого верхнего элемента
Задание 2. Создать двумерный динамический массив с произвольным количеством элементов в каждой сроке. Заполнить его и распечатать построчно. 
*/


#include <stdio.h>

int main()
{

	return 0;
}
