;-----------------------------------------------------------------------------------------------------
; Пример типичной программы(сокращённый вариант)
;-----------------------------------------------------------------------------------------------------
model small		; директива компилятору для реального режима
.data			; сегмент данных
;----------------------------
; Исходные данные 
msg	db	0dh,0ah
msg1	db	13,10,'Введите число(1-9)(0 или Enter выход)$'
msg2	db	13,10,'Получилось:$'
msg3	db	'Ошибка:$'
;----------------------------
.code			; сегмент кода
start:			; точка входа в программу(начало)
	mov	ax,@data	; связываем регистр ds с сегментом
	mov	ds,ax		;	данных через регистр ax
	
;------------------------------------------------------
; Код(команды ассемблера) программы
met:
	mov  ah,09h
	lea  dx, msg1
	int  21h

	mov  ah,01h
	int  21h

	cmp  al,0dh
	je   fin

	cmp  al, '0'
	jb   error

	cmp  al, '9'
	ja   error

	jmp  met
		
fin:
	error:
	push  ax
	mov  ah, 09h
	lea  dx, msg3
	int  21h

	pop  ax
	mov  ah,02h
	mov  dl,al
	int  21h
	jmp  met

;-------------------------------------------------
	mov	ax,4c00h	; 4c00h - код функции для стандартного
				;	 выхода
	int	21h		; стандартный выход
;---------------------------------
;  Подпрограммы
;---------------------------------
end	start			; конец программы
